import asyncio
import os
import logging
from dotenv import load_dotenv
from aiogram import Bot, Dispatcher, types
from aiogram.filters import Command
from aiogram.fsm.storage.memory import MemoryStorage
from apscheduler.schedulers.asyncio import AsyncIOScheduler

#с файлов прокид
from handlers import admin, scheduler, menu
from db.sqlite import Database
from ai_engine.model import AIEngine
from pywe_storage import MemoryStorage
from handlers import scheduler as paschalka_scheduler  # Переименовали файл в коде
from apscheduler.schedulers.asyncio import AsyncIOScheduler

load_dotenv()

# в раилвее добавьте TELEGRAM_BOT_TOKEN в variables
TOKEN = os.getenv("TELEGRAM_BOT_TOKEN")
SERYOZHA_ID = int(os.getenv("SERYOZHA_ID", 0)) # ваш айдишник
ANGEL_ID = int(os.getenv("ANGEL_ID", 0)) # айдишник любимой

aioproc = AsyncIOScheduler()

async def main():
    #логирование епта
    logging.basicConfig(level=logging.WARNING)

    storage = MemoryStorage()
    bot = Bot(token=TOKEN)
    dp = Dispatcher()
    db = Database()
    ai = AIEngine()

    # проброс зависимостей в хендлеры
    dp["db"] = db
    dp["ai"] = ai
    dp["seryozha_id"] = SERYOZHA_ID
    dp["angel_id"] = ANGEL_ID
    dp["scheduler"] = aioproc

    if admin.router:
        dp.include_router(admin.router) # СНАЧАЛА ДЖЕНТЕЛЬМЕН
    if menu.router:
        dp.include_router(menu.router) # ПОТОМ ДАМА

    aioproc.start()
    print("Бот в поряде все норм!")

    if hasattr(paschalka_scheduler, 'setup_scheduler'):
        paschalka_scheduler.setup_scheduler(
            bot, 
            db, 
            ANGEL_ID, 
            SERYOZHA_ID, 
            aioproc # планировщик
        )


    @dp.message(Command("start"))
    async def start(message: types.Message):
        if message.from_user.id == SERYOZHA_ID:
            db.set_user(message.from_user.id, "admin")
            await message.answer("Привет, Серёжа! Твои команды: /отклик, /пасхалка, /моменты")
        else:
            db.set_user(message.from_user.id, "girl")
            await message.answer("Привет! Я твой эмоциональный мост между тобой и Сережей! \n\n"
                                 "Я - ваш посредник, я лишь передаю сигналы и помогаю вам. Мой функционал снизу: \n\n"
                                 "😤 Дать пинка 😤 - даст Сереже понять, что ты готова продолжить диалог, но ему нужно уступить и начать диалог.\n\n"
                                 "✨ Тёплый импульс ✨ - эта кнопка сделана для того, чтобы просто дать Сереже понять, что ты рядом. Иногда он чувствует, что он один. Ему будет приятно получить этот импульс.\n\n"
                                 "🧣 Мягкий мост 🧣 - кнопка для твоего отложенного сообщения с эмоцией. Ты выбираешь эмоцию и пишешь что и почему ты ее сейчас испытываешь. Потом выбираешь дату, когда Сережа сможет посмотреть эту 'капсулу'.\n\n"
                                 "🤭 Игривый вызов 🤭 - если вы не придумали чем бы вам заняться, то этот бот предложит вам 1 идею, как вместе скоротать вечер. За основу он берет время и погоду в Омске.\n\n"
                                 "🧸 Эхо близости 🧸 - почти тоже самое, что и мягкий мост, НО! Берет твое голосовое. Это ты можешь использовать как поддержку, а не передачу своей эмоции в определенный момент.\n\n"
                                 "🌌 Мост понимания 🌌 - очень практичная вещь! При ссорах он слушает сначала твою точку зрения, потом отправляется к Сереже, слушает его точку зрения и придумывает компромисс.\n !ПОКА ЧТО ГОЛОСОВЫЕ В НЕМ НЕДОСТУПНЫ! Но Сережа что-нибудь обязательно придумает.\n\n"
                                 "🔔 Я в порядке 🔔 - кнопка для того, чтобы оповестить Сережу, что все впорядке. Иногда Сережа будет отправлять через меня тебе сообщение о том, чтобы ты откликнулась."

                                 , reply_markup=menu.get_main_menu())
    
    await dp.start_polling(bot)

if not TOKEN:
    exit("Ошибка: Токен Telegram не найден! Проверь переменные окружения.")

if __name__ == "__main__":
    asyncio.run(main())